{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "cc507056",
   "metadata": {},
   "outputs": [],
   "source": [
    "#pip install git+https://github.com/promptslab/Promptify.git"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "50486516",
   "metadata": {},
   "outputs": [],
   "source": [
    "#pip install pandas"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "e943aae9",
   "metadata": {},
   "outputs": [],
   "source": [
    "#pip install openpyxl"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "91b44110",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\sanka\\anaconda3\\envs\\myenv1\\lib\\site-packages\\tqdm\\auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html\n",
      "  from .autonotebook import tqdm as notebook_tqdm\n"
     ]
    }
   ],
   "source": [
    "import pandas as pd\n",
    "import numpy as np\n",
    "from promptify import OpenAI\n",
    "from promptify import Prompter"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "fb4b030c",
   "metadata": {},
   "outputs": [],
   "source": [
    "#cybersecurity articles in excelsheet to dataframe\n",
    "fileName = 'th_db_sub.xlsx'\n",
    "df1 = pd.read_excel(fileName,sheet_name=\"Sheet1\")\n",
    "df1=df1[1:2]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "b2c836c4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Sentence</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>The nation-state adversary group known as FANC...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                            Sentence\n",
       "1  The nation-state adversary group known as FANC..."
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "6a657842",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "624 3376\n",
      "              Label                                          Node Name   \n",
      "0       Threatactor                                         FANCY BEAR  \\\n",
      "1           Aliases                                              APT28   \n",
      "2           Aliases                                             SOFACY   \n",
      "3           Targets                                          AEROSPACE   \n",
      "4           Targets                                            DEFENSE   \n",
      "5           Targets                                             ENERGY   \n",
      "6           Targets                                         GOVERNMENT   \n",
      "7           Targets                                              MEDIA   \n",
      "8           Targets                                         DISSIDENTS   \n",
      "9   Tools/Technique                                  PHISHING MESSAGES   \n",
      "10  Tools/Technique                              CREDENTIAL HARVESTING   \n",
      "11  Tools/Technique                                             XAGENT   \n",
      "12  Tools/Technique                                           X-TUNNEL   \n",
      "13  Tools/Technique                                             WINIDS   \n",
      "14  Tools/Technique                                             FOOZER   \n",
      "15  Tools/Technique                                          DOWNRANGE   \n",
      "16   BelievedOrigin                                             RUSSIA   \n",
      "17   BelievedOrigin  ГЛАВНОЕ РАЗВЕДЫВАТЕЛЬНОЕ УПРАВЛЕНИЕ (MAIN INTE...   \n",
      "\n",
      "         Topic  \n",
      "0               \n",
      "1   FANCY BEAR  \n",
      "2   FANCY BEAR  \n",
      "3   FANCY BEAR  \n",
      "4   FANCY BEAR  \n",
      "5   FANCY BEAR  \n",
      "6   FANCY BEAR  \n",
      "7   FANCY BEAR  \n",
      "8   FANCY BEAR  \n",
      "9   FANCY BEAR  \n",
      "10  FANCY BEAR  \n",
      "11  FANCY BEAR  \n",
      "12  FANCY BEAR  \n",
      "13  FANCY BEAR  \n",
      "14  FANCY BEAR  \n",
      "15  FANCY BEAR  \n",
      "16  FANCY BEAR  \n",
      "17  FANCY BEAR  \n"
     ]
    }
   ],
   "source": [
    "# Create an empty DataFrame to store the results of NLP model\n",
    "all_results_df = pd.DataFrame()\n",
    "\n",
    "for index, row in df1.iterrows():\n",
    "    sentence = df1[\"Sentence\"][index]\n",
    "\n",
    "\n",
    "    model = OpenAI(api_key=\"xxx\")\n",
    "    nlp_prompter = Prompter(model)\n",
    "    result = nlp_prompter.fit('ner.jinja',\n",
    "                          domain      = 'cybersecurity',\n",
    "                          text_input  = sentence, \n",
    "                          labels      = ['Threatactor', 'Aliases', 'Targets', 'Tools/Technique',\n",
    "       'BelievedOrigin'])\n",
    "\n",
    "    #print(eval(result['text']))\n",
    "\n",
    "    parsed_data = []\n",
    "    for item in result:\n",
    "        completion = item['parsed']['data']['completion']\n",
    "        parsed_data.extend(completion)\n",
    "    #print(parsed_data ) \n",
    "    df=pd.DataFrame.from_records(parsed_data)\n",
    "\n",
    "    df=df[['T','E']]\n",
    "    # change the values in the 'column_name' column to uppercase\n",
    "    df['E'] = df['E'].str.upper()\n",
    "    df=df.dropna()\n",
    "    # rename columns\n",
    "    df = df.rename(columns={'T': 'Label', 'E': 'Node Name'})\n",
    "\n",
    "    # Get the 'Threatactor' row\n",
    "    threatactor_row = df[df['Label'] == 'Threatactor']\n",
    "\n",
    "    # Set the 'Topic' column based on the 'Node Name' column, using the 'Label' value from the 'Threatactor' row\n",
    "    df['Topic'] = np.where(df['Label'] == 'Threatactor', '', threatactor_row['Node Name'].iloc[0])\n",
    "\n",
    "    # Concatenate the result_df to the all_results_df DataFrame\n",
    "    all_results_df = pd.concat([all_results_df, df], ignore_index=True)\n",
    "\n",
    "print(all_results_df)\n",
    "  "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "49f0a733",
   "metadata": {},
   "outputs": [],
   "source": [
    "df=all_results_df\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "92a2dc03",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "array(['Threatactor', 'Aliases', 'Targets', 'Tools/Technique',\n",
       "       'BelievedOrigin'], dtype=object)"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Look at unique labels\n",
    "df.Label.unique()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "c487c926",
   "metadata": {},
   "outputs": [],
   "source": [
    "#drop the duplicates\n",
    "df=df.drop_duplicates()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "913ceef8",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Build the vertices (nodes) - \n",
    "VERTICES = []\n",
    "EDGES = []\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "015bff95",
   "metadata": {},
   "outputs": [],
   "source": [
    "# vertices for Thraetactor label\n",
    "threat_actor = df[df.Label=='Threatactor']\n",
    "threat_actor = threat_actor.drop(columns=['Topic'])\n",
    "threat_actor=threat_actor.drop_duplicates()\n",
    "for index,threat in threat_actor.iterrows():\n",
    "    VERTICES.append(f\"g.addV('{threat.Label}').property('name','{threat['Node Name']}').property('type','Threatactor')\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "0a39f856",
   "metadata": {},
   "outputs": [],
   "source": [
    "# vertices for Aliases label\n",
    "threat_aliases = df[df.Label=='Aliases']\n",
    "threat_aliases = threat_aliases.drop(columns=['Topic'])\n",
    "threat_aliases=threat_aliases.drop_duplicates()\n",
    "for index,threatas in threat_aliases.iterrows():\n",
    "    VERTICES.append(f\"g.addV('{threatas.Label}').property('name','{threatas['Node Name']}').property('type','Threatactor')\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "34e646da",
   "metadata": {},
   "outputs": [],
   "source": [
    "# vertices for Thraetactor Targets\n",
    "threat_targets = df[df.Label=='Targets']\n",
    "threat_targets = threat_targets.drop(columns=['Topic'])\n",
    "threat_targets = threat_targets.drop_duplicates()\n",
    "for index,target in threat_targets.iterrows():\n",
    "    VERTICES.append(f\"g.addV('{target.Label}').property('name','{target['Node Name']}').property('type','Threatactor')\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "02fee28c",
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "# vertices for Thraetactor Tools/Technique\n",
    "threat_tools = df[df.Label=='Tools/Technique']\n",
    "threat_tools = threat_tools.drop(columns=['Topic'])\n",
    "threat_tools = threat_tools.drop_duplicates()\n",
    "for index,tool in threat_tools.iterrows():\n",
    "    VERTICES.append(f\"g.addV('{tool.Label}').property('name','{tool['Node Name']}').property('type','Threatactor')\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "917cb0ee",
   "metadata": {},
   "outputs": [],
   "source": [
    "# vertices for Thraetactor BelievedOrigin\n",
    "threat_origin = df[df.Label=='BelievedOrigin']\n",
    "threat_origin = threat_origin.drop(columns=['Topic'])\n",
    "threat_origin = threat_origin.drop_duplicates()\n",
    "for index,origin in threat_origin.iterrows():\n",
    "    VERTICES.append(f\"g.addV('{origin.Label}').property('name','{origin['Node Name']}').property('type','Threatactor')\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "edc02e6d",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Add Targets to Threatactor\n",
    "target_edge = df[df.Label=='Targets']\n",
    "for index, tar in target_edge.iterrows():\n",
    "    EDGES.append(f\"g.V().hasLabel('Threatactor').has('name','{tar['Topic']}').addE('target_to').to(g.V().hasLabel('Targets').has('name','{tar['Node Name']}'))\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "52d24f87",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Add Tools/Technique to Threatactor\n",
    "tool_edge = df[df.Label=='Tools/Technique']\n",
    "for index, tool in tool_edge.iterrows():\n",
    "    EDGES.append(f\"g.V().hasLabel('Threatactor').has('name','{tool['Topic']}').addE('uses').to(g.V().hasLabel('Tools/Technique').has('name','{tool['Node Name']}'))\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "ddb61c10",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Add BelievedOrigin to Threatactor\n",
    "origin_edge = df[df.Label=='BelievedOrigin']\n",
    "for index, org in origin_edge.iterrows():\n",
    "    EDGES.append(f\"g.V().hasLabel('Threatactor').has('name','{org['Topic']}').addE('belongs_to').to(g.V().hasLabel('BelievedOrigin').has('name','{org['Node Name']}'))\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "d42064aa",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Add Aliases(out) to Threatactor(in)\n",
    "aliases_edge = df[df.Label=='Aliases']\n",
    "for index, sub in aliases_edge.iterrows():\n",
    "    EDGES.append(f\"g.V().hasLabel('Aliases').has('name','{sub['Node Name']}').addE('aliases_is').to(g.V().hasLabel('Threatactor').has('name','{sub['Topic']}'))\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "beee7421",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[\"g.addV('Threatactor').property('name','FANCY BEAR').property('type','Threatactor')\",\n",
       " \"g.addV('Aliases').property('name','APT28').property('type','Threatactor')\",\n",
       " \"g.addV('Aliases').property('name','SOFACY').property('type','Threatactor')\",\n",
       " \"g.addV('Targets').property('name','AEROSPACE').property('type','Threatactor')\",\n",
       " \"g.addV('Targets').property('name','DEFENSE').property('type','Threatactor')\",\n",
       " \"g.addV('Targets').property('name','ENERGY').property('type','Threatactor')\",\n",
       " \"g.addV('Targets').property('name','GOVERNMENT').property('type','Threatactor')\",\n",
       " \"g.addV('Targets').property('name','MEDIA').property('type','Threatactor')\",\n",
       " \"g.addV('Targets').property('name','DISSIDENTS').property('type','Threatactor')\",\n",
       " \"g.addV('Tools/Technique').property('name','PHISHING MESSAGES').property('type','Threatactor')\",\n",
       " \"g.addV('Tools/Technique').property('name','CREDENTIAL HARVESTING').property('type','Threatactor')\",\n",
       " \"g.addV('Tools/Technique').property('name','XAGENT').property('type','Threatactor')\",\n",
       " \"g.addV('Tools/Technique').property('name','X-TUNNEL').property('type','Threatactor')\",\n",
       " \"g.addV('Tools/Technique').property('name','WINIDS').property('type','Threatactor')\",\n",
       " \"g.addV('Tools/Technique').property('name','FOOZER').property('type','Threatactor')\",\n",
       " \"g.addV('Tools/Technique').property('name','DOWNRANGE').property('type','Threatactor')\",\n",
       " \"g.addV('BelievedOrigin').property('name','RUSSIA').property('type','Threatactor')\",\n",
       " \"g.addV('BelievedOrigin').property('name','ГЛАВНОЕ РАЗВЕДЫВАТЕЛЬНОЕ УПРАВЛЕНИЕ (MAIN INTELLIGENCE DEPARTMENT) OR GRU').property('type','Threatactor')\"]"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "VERTICES"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "549ae6e7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[\"g.V().hasLabel('Threatactor').has('name','FANCY BEAR').addE('target_to').to(g.V().hasLabel('Targets').has('name','AEROSPACE'))\",\n",
       " \"g.V().hasLabel('Threatactor').has('name','FANCY BEAR').addE('target_to').to(g.V().hasLabel('Targets').has('name','DEFENSE'))\",\n",
       " \"g.V().hasLabel('Threatactor').has('name','FANCY BEAR').addE('target_to').to(g.V().hasLabel('Targets').has('name','ENERGY'))\",\n",
       " \"g.V().hasLabel('Threatactor').has('name','FANCY BEAR').addE('target_to').to(g.V().hasLabel('Targets').has('name','GOVERNMENT'))\",\n",
       " \"g.V().hasLabel('Threatactor').has('name','FANCY BEAR').addE('target_to').to(g.V().hasLabel('Targets').has('name','MEDIA'))\",\n",
       " \"g.V().hasLabel('Threatactor').has('name','FANCY BEAR').addE('target_to').to(g.V().hasLabel('Targets').has('name','DISSIDENTS'))\",\n",
       " \"g.V().hasLabel('Threatactor').has('name','FANCY BEAR').addE('uses').to(g.V().hasLabel('Tools/Technique').has('name','PHISHING MESSAGES'))\",\n",
       " \"g.V().hasLabel('Threatactor').has('name','FANCY BEAR').addE('uses').to(g.V().hasLabel('Tools/Technique').has('name','CREDENTIAL HARVESTING'))\",\n",
       " \"g.V().hasLabel('Threatactor').has('name','FANCY BEAR').addE('uses').to(g.V().hasLabel('Tools/Technique').has('name','XAGENT'))\",\n",
       " \"g.V().hasLabel('Threatactor').has('name','FANCY BEAR').addE('uses').to(g.V().hasLabel('Tools/Technique').has('name','X-TUNNEL'))\",\n",
       " \"g.V().hasLabel('Threatactor').has('name','FANCY BEAR').addE('uses').to(g.V().hasLabel('Tools/Technique').has('name','WINIDS'))\",\n",
       " \"g.V().hasLabel('Threatactor').has('name','FANCY BEAR').addE('uses').to(g.V().hasLabel('Tools/Technique').has('name','FOOZER'))\",\n",
       " \"g.V().hasLabel('Threatactor').has('name','FANCY BEAR').addE('uses').to(g.V().hasLabel('Tools/Technique').has('name','DOWNRANGE'))\",\n",
       " \"g.V().hasLabel('Threatactor').has('name','FANCY BEAR').addE('belongs_to').to(g.V().hasLabel('BelievedOrigin').has('name','RUSSIA'))\",\n",
       " \"g.V().hasLabel('Threatactor').has('name','FANCY BEAR').addE('belongs_to').to(g.V().hasLabel('BelievedOrigin').has('name','ГЛАВНОЕ РАЗВЕДЫВАТЕЛЬНОЕ УПРАВЛЕНИЕ (MAIN INTELLIGENCE DEPARTMENT) OR GRU'))\",\n",
       " \"g.V().hasLabel('Aliases').has('name','APT28').addE('aliases_is').to(g.V().hasLabel('Threatactor').has('name','FANCY BEAR'))\",\n",
       " \"g.V().hasLabel('Aliases').has('name','SOFACY').addE('aliases_is').to(g.V().hasLabel('Threatactor').has('name','FANCY BEAR'))\"]"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "EDGES"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "105d95cf",
   "metadata": {},
   "outputs": [],
   "source": [
    "#!pip install gremlinpython"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "d636ba9d",
   "metadata": {},
   "outputs": [],
   "source": [
    "from gremlin_python.driver import client, serializer, protocol\n",
    "from gremlin_python.driver.protocol import GremlinServerError\n",
    "import sys\n",
    "import traceback\n",
    "import asyncio\n",
    "import collections.abc as collections\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "9213f4f2",
   "metadata": {},
   "outputs": [],
   "source": [
    "#!az login\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "1edd5b0a",
   "metadata": {},
   "outputs": [],
   "source": [
    "#To populate the data into cosmosdb\n",
    "ENDPOINT = 'wss://cosmosdbinstance1.gremlin.cosmos.azure.com'\n",
    "PRIMARY_KEY =\"xxx\"\n",
    "DATABASE = 'threatactordb'\n",
    "COLLECTION = 'threatactorgraph'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "3ea00efa",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Welcome to Azure Cosmos DB + Gremlin on Python!\n",
      "We're about to drop whatever graph is on the server. Press any key to continue...\n",
      "\n",
      "> g.V().drop()\n",
      "\n",
      "\n",
      "\tResponse status_attributes:\n",
      "\t{'x-ms-status-code': 200, 'x-ms-activity-id': 'ba6d998d-0403-4d60-8091-265e88f5c55d', 'x-ms-request-charge': 2.79, 'x-ms-total-request-charge': 2.79, 'x-ms-server-time-ms': 42.8645, 'x-ms-total-server-time-ms': 42.8645}\n",
      "\n",
      "\n",
      "Let's insert some vertices into the graph. Press any key to continue...\n",
      "\n",
      "> g.addV('Threatactor').property('name','CrowdStrike Intelligence').property('type','Threatactor')\n",
      "\n",
      "\tInserted this vertex:\n",
      "\t[{'id': '2f926218-893a-4245-8045-c76bce517a29', 'label': 'Threatactor', 'type': 'vertex', 'properties': {'name': [{'id': 'b497ebba-25d2-4299-a4ca-a1c6c96dafca', 'value': 'CrowdStrike Intelligence'}], 'type': [{'id': '2f926218-893a-4245-8045-c76bce517a29|type', 'value': 'Threatactor'}]}}]\n",
      "\n",
      "\n",
      "\tResponse status_attributes:\n",
      "\t{'x-ms-status-code': 200, 'x-ms-activity-id': 'ea3ccaff-a9d0-4aa0-a708-c983219040d8', 'x-ms-request-charge': 7.81, 'x-ms-total-request-charge': 7.81, 'x-ms-server-time-ms': 30.3131, 'x-ms-total-server-time-ms': 30.3131}\n",
      "\n",
      "\n",
      "\n",
      "> g.addV('Threatactor').property('name','Intelligence').property('type','Threatactor')\n",
      "\n",
      "\tInserted this vertex:\n",
      "\t[{'id': '6366b3ca-fa0b-459a-a443-5684057f7ecf', 'label': 'Threatactor', 'type': 'vertex', 'properties': {'name': [{'id': '1cac8ab0-6052-4130-8572-8cb42d634948', 'value': 'Intelligence'}], 'type': [{'id': '6366b3ca-fa0b-459a-a443-5684057f7ecf|type', 'value': 'Threatactor'}]}}]\n",
      "\n",
      "\n",
      "\tResponse status_attributes:\n",
      "\t{'x-ms-status-code': 200, 'x-ms-activity-id': 'd994174d-1f03-4919-9630-5648c8cc0923', 'x-ms-request-charge': 7.81, 'x-ms-total-request-charge': 7.81, 'x-ms-server-time-ms': 43.1365, 'x-ms-total-server-time-ms': 43.1365}\n",
      "\n",
      "\n",
      "\n",
      "> g.addV('Aliases').property('name','CrowdStrike').property('type','Threatactor')\n",
      "\n",
      "\tInserted this vertex:\n",
      "\t[{'id': '2c75f852-853e-4418-a788-c9c2f1a0253d', 'label': 'Aliases', 'type': 'vertex', 'properties': {'name': [{'id': '475cb43c-9510-42bb-be30-1b5b440c2a39', 'value': 'CrowdStrike'}], 'type': [{'id': '2c75f852-853e-4418-a788-c9c2f1a0253d|type', 'value': 'Threatactor'}]}}]\n",
      "\n",
      "\n",
      "\tResponse status_attributes:\n",
      "\t{'x-ms-status-code': 200, 'x-ms-activity-id': 'e0901734-6e58-4c7d-a6d1-07c5983d4ae5', 'x-ms-request-charge': 7.81, 'x-ms-total-request-charge': 7.81, 'x-ms-server-time-ms': 32.7315, 'x-ms-total-server-time-ms': 32.7315}\n",
      "\n",
      "\n",
      "\n",
      "> g.addV('Tools/Technique').property('name','Falcon Platform').property('type','Threatactor')\n",
      "\n",
      "\tInserted this vertex:\n",
      "\t[{'id': '72cb09ba-0f75-491d-a669-2e96618ad137', 'label': 'Tools/Technique', 'type': 'vertex', 'properties': {'name': [{'id': '0f7193f4-9bd3-4765-9e19-e149d290cf28', 'value': 'Falcon Platform'}], 'type': [{'id': '72cb09ba-0f75-491d-a669-2e96618ad137|type', 'value': 'Threatactor'}]}}]\n",
      "\n",
      "\n",
      "\tResponse status_attributes:\n",
      "\t{'x-ms-status-code': 200, 'x-ms-activity-id': '8680506a-d86e-4f44-b630-b536c44636a0', 'x-ms-request-charge': 7.81, 'x-ms-total-request-charge': 7.81, 'x-ms-server-time-ms': 45.7655, 'x-ms-total-server-time-ms': 45.7655}\n",
      "\n",
      "\n",
      "\n",
      "> g.addV('Tools/Technique').property('name','Phishing Email').property('type','Threatactor')\n",
      "\n",
      "\tInserted this vertex:\n",
      "\t[{'id': 'caa7b53d-25ad-4b74-9e38-b66fdfb67db3', 'label': 'Tools/Technique', 'type': 'vertex', 'properties': {'name': [{'id': '8414b74c-7aa8-4ee1-88cb-6d373a2c1930', 'value': 'Phishing Email'}], 'type': [{'id': 'caa7b53d-25ad-4b74-9e38-b66fdfb67db3|type', 'value': 'Threatactor'}]}}]\n",
      "\n",
      "\n",
      "\tResponse status_attributes:\n",
      "\t{'x-ms-status-code': 200, 'x-ms-activity-id': '2ab484cc-9a51-4c77-9da2-01018b8a9143', 'x-ms-request-charge': 7.81, 'x-ms-total-request-charge': 7.81, 'x-ms-server-time-ms': 46.4275, 'x-ms-total-server-time-ms': 46.4275}\n",
      "\n",
      "\n",
      "\n",
      "> g.addV('Tools/Technique').property('name','BazarCall campaign').property('type','Threatactor')\n",
      "\n",
      "\tInserted this vertex:\n",
      "\t[{'id': '016a0e23-8a5b-4932-b5d0-2bf4db3fe5d2', 'label': 'Tools/Technique', 'type': 'vertex', 'properties': {'name': [{'id': 'e6d642d5-59a1-45b9-81cf-32371fb59a55', 'value': 'BazarCall campaign'}], 'type': [{'id': '016a0e23-8a5b-4932-b5d0-2bf4db3fe5d2|type', 'value': 'Threatactor'}]}}]\n",
      "\n",
      "\n",
      "\tResponse status_attributes:\n",
      "\t{'x-ms-status-code': 200, 'x-ms-activity-id': '58666859-3444-4eb7-97e3-8afece349a72', 'x-ms-request-charge': 7.81, 'x-ms-total-request-charge': 7.81, 'x-ms-server-time-ms': 21.4618, 'x-ms-total-server-time-ms': 21.4618}\n",
      "\n",
      "\n",
      "\n",
      "> g.addV('Tools/Technique').property('name','RATs').property('type','Threatactor')\n",
      "\n",
      "\tInserted this vertex:\n",
      "\t[{'id': 'b58a8870-bb4e-4024-bbc5-055a82cf1186', 'label': 'Tools/Technique', 'type': 'vertex', 'properties': {'name': [{'id': '7ba16b1d-1668-4661-a6ce-baa6fdac3d9b', 'value': 'RATs'}], 'type': [{'id': 'b58a8870-bb4e-4024-bbc5-055a82cf1186|type', 'value': 'Threatactor'}]}}]\n",
      "\n",
      "\n",
      "\tResponse status_attributes:\n",
      "\t{'x-ms-status-code': 200, 'x-ms-activity-id': '2998a6fb-6aca-4bee-bbc2-b86e5724c744', 'x-ms-request-charge': 7.81, 'x-ms-total-request-charge': 7.81, 'x-ms-server-time-ms': 45.5, 'x-ms-total-server-time-ms': 45.5}\n",
      "\n",
      "\n",
      "\n",
      "> g.addV('Tools/Technique').property('name','Penetration Testing Tools').property('type','Threatactor')\n",
      "\n",
      "\tInserted this vertex:\n",
      "\t[{'id': 'aa57836f-ee49-4e7e-8d2b-74a37d6bc3f9', 'label': 'Tools/Technique', 'type': 'vertex', 'properties': {'name': [{'id': '672c3207-e35a-40a2-aaf7-c94c8b3a94b3', 'value': 'Penetration Testing Tools'}], 'type': [{'id': 'aa57836f-ee49-4e7e-8d2b-74a37d6bc3f9|type', 'value': 'Threatactor'}]}}]\n",
      "\n",
      "\n",
      "\tResponse status_attributes:\n",
      "\t{'x-ms-status-code': 200, 'x-ms-activity-id': '764c41c1-27e2-42a3-9a1e-adf2047bc81c', 'x-ms-request-charge': 7.81, 'x-ms-total-request-charge': 7.81, 'x-ms-server-time-ms': 17.3828, 'x-ms-total-server-time-ms': 17.3828}\n",
      "\n",
      "\n",
      "\n",
      "> g.addV('Tools/Technique').property('name','Ransomware').property('type','Threatactor')\n",
      "\n",
      "\tInserted this vertex:\n",
      "\t[{'id': '704bd694-eeb2-4186-b89d-8ab6aabde2ad', 'label': 'Tools/Technique', 'type': 'vertex', 'properties': {'name': [{'id': 'c675bd05-b6fa-4069-91da-0fbf282f5c77', 'value': 'Ransomware'}], 'type': [{'id': '704bd694-eeb2-4186-b89d-8ab6aabde2ad|type', 'value': 'Threatactor'}]}}]\n",
      "\n",
      "\n",
      "\tResponse status_attributes:\n",
      "\t{'x-ms-status-code': 200, 'x-ms-activity-id': '331be4b0-3831-421d-aa94-e724dd454080', 'x-ms-request-charge': 7.81, 'x-ms-total-request-charge': 7.81, 'x-ms-server-time-ms': 5.6352, 'x-ms-total-server-time-ms': 5.6352}\n",
      "\n",
      "\n",
      "\n",
      "> g.addV('Tools/Technique').property('name','Data Extortion').property('type','Threatactor')\n",
      "\n",
      "\tInserted this vertex:\n",
      "\t[{'id': 'ffb29ac7-0c35-4c35-82e3-8533599fabbe', 'label': 'Tools/Technique', 'type': 'vertex', 'properties': {'name': [{'id': '55ba35e4-5caa-4192-aa5a-6444aa9c53d4', 'value': 'Data Extortion'}], 'type': [{'id': 'ffb29ac7-0c35-4c35-82e3-8533599fabbe|type', 'value': 'Threatactor'}]}}]\n",
      "\n",
      "\n",
      "\tResponse status_attributes:\n",
      "\t{'x-ms-status-code': 200, 'x-ms-activity-id': '93bb92f1-a40e-499c-ab0e-e980d68e0dbe', 'x-ms-request-charge': 7.81, 'x-ms-total-request-charge': 7.81, 'x-ms-server-time-ms': 5.6838, 'x-ms-total-server-time-ms': 5.6838}\n",
      "\n",
      "\n",
      "\n",
      "> g.addV('BelievedOrigin').property('name','China').property('type','Threatactor')\n",
      "\n",
      "\tInserted this vertex:\n",
      "\t[{'id': 'b3e53e91-b735-480e-a711-8cc0c147a490', 'label': 'BelievedOrigin', 'type': 'vertex', 'properties': {'name': [{'id': 'c8513445-69dc-4098-84ad-e759290c6f0e', 'value': 'China'}], 'type': [{'id': 'b3e53e91-b735-480e-a711-8cc0c147a490|type', 'value': 'Threatactor'}]}}]\n",
      "\n",
      "\n",
      "\tResponse status_attributes:\n",
      "\t{'x-ms-status-code': 200, 'x-ms-activity-id': 'f99c4a22-ead1-4fe4-9a64-8918965b6965', 'x-ms-request-charge': 7.81, 'x-ms-total-request-charge': 7.81, 'x-ms-server-time-ms': 5.8619, 'x-ms-total-server-time-ms': 5.8619}\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "Now, let's add some edges between the vertices. Press any key to continue...\n",
      "\n",
      "> g.V().hasLabel('Threatactor').has('name','CrowdStrike Intelligence').addE('uses').to(g.V().hasLabel('Tools/Technique').has('name','Falcon Platform'))\n",
      "\n",
      "\tInserted this edge:\n",
      "\t[{'id': '40cfb95a-5f81-40d1-aa54-a7fca69beb87', 'label': 'uses', 'type': 'edge', 'inVLabel': 'Tools/Technique', 'outVLabel': 'Threatactor', 'inV': '72cb09ba-0f75-491d-a669-2e96618ad137', 'outV': '2f926218-893a-4245-8045-c76bce517a29'}]\n",
      "\n",
      "\tResponse status_attributes:\n",
      "\t{'x-ms-status-code': 200, 'x-ms-activity-id': 'bb61959c-f0a8-456e-883f-0c4d30c004a1', 'x-ms-request-charge': 14.620000000000001, 'x-ms-total-request-charge': 14.620000000000001, 'x-ms-server-time-ms': 39.8817, 'x-ms-total-server-time-ms': 39.8817}\n",
      "\n",
      "\n",
      "\n",
      "> g.V().hasLabel('Threatactor').has('name','Intelligence').addE('uses').to(g.V().hasLabel('Tools/Technique').has('name','Phishing Email'))\n",
      "\n",
      "\tInserted this edge:\n",
      "\t[{'id': '25bb186b-8e47-45ad-86af-c82466f60336', 'label': 'uses', 'type': 'edge', 'inVLabel': 'Tools/Technique', 'outVLabel': 'Threatactor', 'inV': 'caa7b53d-25ad-4b74-9e38-b66fdfb67db3', 'outV': '6366b3ca-fa0b-459a-a443-5684057f7ecf'}]\n",
      "\n",
      "\tResponse status_attributes:\n",
      "\t{'x-ms-status-code': 200, 'x-ms-activity-id': '8824ad01-e051-400c-850d-307f04e3f09f', 'x-ms-request-charge': 14.620000000000001, 'x-ms-total-request-charge': 14.620000000000001, 'x-ms-server-time-ms': 28.8073, 'x-ms-total-server-time-ms': 28.8073}\n",
      "\n",
      "\n",
      "\n",
      "> g.V().hasLabel('Threatactor').has('name','Intelligence').addE('uses').to(g.V().hasLabel('Tools/Technique').has('name','BazarCall campaign'))\n",
      "\n",
      "\tInserted this edge:\n",
      "\t[{'id': 'f0cac8de-03a1-4067-9c6d-c31f78114f5b', 'label': 'uses', 'type': 'edge', 'inVLabel': 'Tools/Technique', 'outVLabel': 'Threatactor', 'inV': '016a0e23-8a5b-4932-b5d0-2bf4db3fe5d2', 'outV': '6366b3ca-fa0b-459a-a443-5684057f7ecf'}]\n",
      "\n",
      "\tResponse status_attributes:\n",
      "\t{'x-ms-status-code': 200, 'x-ms-activity-id': '87d2fc96-d1e9-495c-84d4-563eda6c8c70', 'x-ms-request-charge': 14.620000000000001, 'x-ms-total-request-charge': 14.620000000000001, 'x-ms-server-time-ms': 10.8851, 'x-ms-total-server-time-ms': 10.8851}\n",
      "\n",
      "\n",
      "\n",
      "> g.V().hasLabel('Threatactor').has('name','Intelligence').addE('uses').to(g.V().hasLabel('Tools/Technique').has('name','RATs'))\n",
      "\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\tInserted this edge:\n",
      "\t[{'id': '146c1545-6dba-4b0c-b6e1-b721277941b6', 'label': 'uses', 'type': 'edge', 'inVLabel': 'Tools/Technique', 'outVLabel': 'Threatactor', 'inV': 'b58a8870-bb4e-4024-bbc5-055a82cf1186', 'outV': '6366b3ca-fa0b-459a-a443-5684057f7ecf'}]\n",
      "\n",
      "\tResponse status_attributes:\n",
      "\t{'x-ms-status-code': 200, 'x-ms-activity-id': '9f87bffe-c4d2-47c9-bc4a-9a8c80aaf494', 'x-ms-request-charge': 14.620000000000001, 'x-ms-total-request-charge': 14.620000000000001, 'x-ms-server-time-ms': 27.5926, 'x-ms-total-server-time-ms': 27.5926}\n",
      "\n",
      "\n",
      "\n",
      "> g.V().hasLabel('Threatactor').has('name','Intelligence').addE('uses').to(g.V().hasLabel('Tools/Technique').has('name','Penetration Testing Tools'))\n",
      "\n",
      "\tInserted this edge:\n",
      "\t[{'id': 'ced7f819-a26f-49bc-9b66-20384f13e650', 'label': 'uses', 'type': 'edge', 'inVLabel': 'Tools/Technique', 'outVLabel': 'Threatactor', 'inV': 'aa57836f-ee49-4e7e-8d2b-74a37d6bc3f9', 'outV': '6366b3ca-fa0b-459a-a443-5684057f7ecf'}]\n",
      "\n",
      "\tResponse status_attributes:\n",
      "\t{'x-ms-status-code': 200, 'x-ms-activity-id': '11a053dc-1365-4198-bea6-1d82488e9b2e', 'x-ms-request-charge': 14.620000000000001, 'x-ms-total-request-charge': 14.620000000000001, 'x-ms-server-time-ms': 11.8229, 'x-ms-total-server-time-ms': 11.8229}\n",
      "\n",
      "\n",
      "\n",
      "> g.V().hasLabel('Threatactor').has('name','Intelligence').addE('uses').to(g.V().hasLabel('Tools/Technique').has('name','Ransomware'))\n",
      "\n",
      "\tInserted this edge:\n",
      "\t[{'id': 'b35b6e55-3da8-4d3e-bdb7-c00934fb99ef', 'label': 'uses', 'type': 'edge', 'inVLabel': 'Tools/Technique', 'outVLabel': 'Threatactor', 'inV': '704bd694-eeb2-4186-b89d-8ab6aabde2ad', 'outV': '6366b3ca-fa0b-459a-a443-5684057f7ecf'}]\n",
      "\n",
      "\tResponse status_attributes:\n",
      "\t{'x-ms-status-code': 200, 'x-ms-activity-id': '6a17637f-bffd-4bf2-b05b-1b6cce4669f3', 'x-ms-request-charge': 14.620000000000001, 'x-ms-total-request-charge': 14.620000000000001, 'x-ms-server-time-ms': 39.81, 'x-ms-total-server-time-ms': 39.81}\n",
      "\n",
      "\n",
      "\n",
      "> g.V().hasLabel('Threatactor').has('name','Intelligence').addE('uses').to(g.V().hasLabel('Tools/Technique').has('name','Data Extortion'))\n",
      "\n",
      "\tInserted this edge:\n",
      "\t[{'id': '5a1dd097-12dc-4113-a722-38dc7a431156', 'label': 'uses', 'type': 'edge', 'inVLabel': 'Tools/Technique', 'outVLabel': 'Threatactor', 'inV': 'ffb29ac7-0c35-4c35-82e3-8533599fabbe', 'outV': '6366b3ca-fa0b-459a-a443-5684057f7ecf'}]\n",
      "\n",
      "\tResponse status_attributes:\n",
      "\t{'x-ms-status-code': 200, 'x-ms-activity-id': 'ae660d75-2911-4b5d-9a48-44df4a91996a', 'x-ms-request-charge': 14.620000000000001, 'x-ms-total-request-charge': 14.620000000000001, 'x-ms-server-time-ms': 24.8292, 'x-ms-total-server-time-ms': 24.8292}\n",
      "\n",
      "\n",
      "\n",
      "> g.V().hasLabel('Threatactor').has('name','CrowdStrike Intelligence').addE('belongs_to').to(g.V().hasLabel('BelievedOrigin').has('name','China'))\n",
      "\n",
      "\tInserted this edge:\n",
      "\t[{'id': '0c117d2c-d9bb-4a71-a64b-4bad56f3d8b1', 'label': 'belongs_to', 'type': 'edge', 'inVLabel': 'BelievedOrigin', 'outVLabel': 'Threatactor', 'inV': 'b3e53e91-b735-480e-a711-8cc0c147a490', 'outV': '2f926218-893a-4245-8045-c76bce517a29'}]\n",
      "\n",
      "\tResponse status_attributes:\n",
      "\t{'x-ms-status-code': 200, 'x-ms-activity-id': 'dbfe3a35-b635-4163-9428-0042a73921b8', 'x-ms-request-charge': 14.620000000000001, 'x-ms-total-request-charge': 14.620000000000001, 'x-ms-server-time-ms': 26.3084, 'x-ms-total-server-time-ms': 26.3084}\n",
      "\n",
      "\n",
      "\n",
      "> g.V().hasLabel('Aliases').has('name','CrowdStrike').addE('aliases_is').to(g.V().hasLabel('Threatactor').has('name','Intelligence'))\n",
      "\n",
      "\tInserted this edge:\n",
      "\t[{'id': 'efdcd195-353a-42d9-8ae1-0f9676ab3016', 'label': 'aliases_is', 'type': 'edge', 'inVLabel': 'Threatactor', 'outVLabel': 'Aliases', 'inV': '6366b3ca-fa0b-459a-a443-5684057f7ecf', 'outV': '2c75f852-853e-4418-a788-c9c2f1a0253d'}]\n",
      "\n",
      "\tResponse status_attributes:\n",
      "\t{'x-ms-status-code': 200, 'x-ms-activity-id': '98ef3ec3-954e-4995-8a14-f96b95ebd1a0', 'x-ms-request-charge': 14.620000000000001, 'x-ms-total-request-charge': 14.620000000000001, 'x-ms-server-time-ms': 23.2137, 'x-ms-total-server-time-ms': 23.2137}\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "And that's all! Sample complete\n",
      "Press Enter to continue...\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "''"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "# This code is based on azure sdk for python\n",
    "\n",
    "if sys.platform == 'win32':\n",
    "    asyncio.set_event_loop_policy(asyncio.WindowsSelectorEventLoopPolicy())\n",
    "\n",
    "#_gremlin_cleanup_graph = \"g.V().drop()\"\n",
    "\n",
    "_gremlin_insert_vertices =VERTICES\n",
    "\n",
    "_gremlin_insert_edges =EDGES\n",
    "\n",
    "#_gremlin_update_vertices = []\n",
    "\n",
    "#_gremlin_count_vertices = \"g.V().count()\"\n",
    "\n",
    "#_gremlin_traversals = {}\n",
    "\n",
    "#_gremlin_drop_operations ={}\n",
    "\n",
    "def print_status_attributes(result):\n",
    "    # This logs the status attributes returned for successful requests.\n",
    "    # See list of available response status attributes (headers) that Gremlin API can return:\n",
    "    #     https://docs.microsoft.com/en-us/azure/cosmos-db/gremlin-headers#headers\n",
    "    #\n",
    "    # These responses includes total request units charged and total server latency time.\n",
    "    # \n",
    "    # IMPORTANT: Make sure to consume ALL results returend by cliient tothe final status attributes\n",
    "    # for a request. Gremlin result are stream as a sequence of partial response messages\n",
    "    # where the last response contents the complete status attributes set.\n",
    "    #\n",
    "    # This can be \n",
    "    print(\"\\tResponse status_attributes:\\n\\t{0}\".format(result.status_attributes))\n",
    "\n",
    "def cleanup_graph(client):\n",
    "    print(\"\\n> {0}\".format(\n",
    "        _gremlin_cleanup_graph))\n",
    "    callback = client.submitAsync(_gremlin_cleanup_graph)\n",
    "    if callback.result() is not None:\n",
    "        callback.result().all().result() \n",
    "    print(\"\\n\")\n",
    "    print_status_attributes(callback.result())\n",
    "    print(\"\\n\")\n",
    "\n",
    "\n",
    "def insert_vertices(client):\n",
    "    for query in _gremlin_insert_vertices:\n",
    "        print(\"\\n> {0}\\n\".format(query))\n",
    "        callback = client.submitAsync(query)\n",
    "        if callback.result() is not None:\n",
    "            print(\"\\tInserted this vertex:\\n\\t{0}\".format(\n",
    "                callback.result().all().result()))\n",
    "        else:\n",
    "            print(\"Something went wrong with this query: {0}\".format(query))\n",
    "        print(\"\\n\")\n",
    "        print_status_attributes(callback.result())\n",
    "        print(\"\\n\")\n",
    "\n",
    "    print(\"\\n\")\n",
    "\n",
    "\n",
    "def insert_edges(client):\n",
    "    for query in _gremlin_insert_edges:\n",
    "        print(\"\\n> {0}\\n\".format(query))\n",
    "        callback = client.submitAsync(query)\n",
    "        if callback.result() is not None:\n",
    "            print(\"\\tInserted this edge:\\n\\t{0}\\n\".format(\n",
    "                callback.result().all().result()))\n",
    "        else:\n",
    "            print(\"Something went wrong with this query:\\n\\t{0}\".format(query))\n",
    "        print_status_attributes(callback.result())\n",
    "        print(\"\\n\")\n",
    "\n",
    "    print(\"\\n\")\n",
    "\n",
    "\n",
    "def update_vertices(client):\n",
    "    for query in _gremlin_update_vertices:\n",
    "        print(\"\\n> {0}\\n\".format(query))\n",
    "        callback = client.submitAsync(query)\n",
    "        if callback.result() is not None:\n",
    "            print(\"\\tUpdated this vertex:\\n\\t{0}\\n\".format(\n",
    "                callback.result().all().result()))\n",
    "        else:\n",
    "            print(\"Something went wrong with this query:\\n\\t{0}\".format(query))\n",
    "\n",
    "        print_status_attributes(callback.result())\n",
    "        print(\"\\n\")\n",
    "\n",
    "    print(\"\\n\")\n",
    "\n",
    "\n",
    "def count_vertices(client):\n",
    "    print(\"\\n> {0}\".format(\n",
    "        _gremlin_count_vertices))\n",
    "    callback = client.submitAsync(_gremlin_count_vertices)\n",
    "    if callback.result() is not None:\n",
    "        print(\"\\tCount of vertices: {0}\".format(callback.result().all().result()))\n",
    "    else:\n",
    "        print(\"Something went wrong with this query: {0}\".format(\n",
    "            _gremlin_count_vertices))\n",
    "\n",
    "    print(\"\\n\")\n",
    "    print_status_attributes(callback.result())\n",
    "    print(\"\\n\")\n",
    "\n",
    "\n",
    "def execute_traversals(client):\n",
    "    for key in _gremlin_traversals:\n",
    "        print(\"{0}:\".format(key))\n",
    "        print(\"> {0}\\n\".format(\n",
    "            _gremlin_traversals[key]))\n",
    "        callback = client.submitAsync(_gremlin_traversals[key])\n",
    "        for result in callback.result():\n",
    "            print(\"\\t{0}\".format(str(result)))\n",
    "        \n",
    "        print(\"\\n\")\n",
    "        print_status_attributes(callback.result())\n",
    "        print(\"\\n\")\n",
    "\n",
    "\n",
    "def execute_drop_operations(client):\n",
    "    for key in _gremlin_drop_operations:\n",
    "        print(\"{0}:\".format(key))\n",
    "        print(\"\\n> {0}\".format(\n",
    "            _gremlin_drop_operations[key]))\n",
    "        callback = client.submitAsync(_gremlin_drop_operations[key])\n",
    "        for result in callback.result():\n",
    "            print(result)\n",
    "        print_status_attributes(callback.result())\n",
    "        print(\"\\n\")\n",
    "\n",
    "\n",
    "try:\n",
    "    client = client.Client('wss://cosmosauto12.gremlin.cosmos.azure.com:443/', 'g',\n",
    "                           username=\"/dbs/graphdb/colls/graph1\",\n",
    "                           password=\"xxx\",\n",
    "                           message_serializer=serializer.GraphSONSerializersV2d0()\n",
    "                           )\n",
    "\n",
    "    print(\"Welcome to Azure Cosmos DB + Gremlin on Python!\")\n",
    "\n",
    "    # Drop the entire Graph\n",
    "    #input(\"We're about to drop whatever graph is on the server. Press any key to continue...\")\n",
    "    #cleanup_graph(client)\n",
    "\n",
    "    # Insert all vertices\n",
    "    input(\"Let's insert some vertices into the graph. Press any key to continue...\")\n",
    "    insert_vertices(client)\n",
    "\n",
    "    #Create edges between vertices\n",
    "    input(\"Now, let's add some edges between the vertices. Press any key to continue...\")\n",
    "    insert_edges(client)\n",
    "\n",
    "    # Update a vertex\n",
    "    #input(\"Ah, sorry. I made a mistake. Let's change the age of this vertex. Press any key to continue...\")\n",
    "    #update_vertices(client)\n",
    "\n",
    "    # Count all vertices\n",
    "    #input(\"Okay. Let's count how many vertices we have. Press any key to continue...\")\n",
    "    #count_vertices(client)\n",
    "\n",
    "    # Execute traversals and get results\n",
    "    #input(\"Cool! Let's run some traversals on our graph. Press any key to continue...\")\n",
    "    #execute_traversals(client)\n",
    "\n",
    "    # Drop a few vertices and edges\n",
    "    #input(\"So, life happens and now we will make some changes to the graph. Press any key to continue...\")\n",
    "    #execute_drop_operations(client)\n",
    "\n",
    "    # Count all vertices again\n",
    "    #input(\"How many vertices do we have left? Press any key to continue...\")\n",
    "    #count_vertices(client)\n",
    "\n",
    "except GremlinServerError as e:\n",
    "    print('Code: {0}, Attributes: {1}'.format(e.status_code, e.status_attributes))\n",
    "\n",
    "    # GremlinServerError.status_code returns the Gremlin protocol status code\n",
    "    # These are broad status codes which can cover various scenaios, so for more specific\n",
    "    # error handling we recommend using GremlinServerError.status_attributes['x-ms-status-code']\n",
    "    # \n",
    "    # Below shows how to capture the Cosmos DB specific status code and perform specific error handling.\n",
    "    # See detailed set status codes than can be returned here: https://docs.microsoft.com/en-us/azure/cosmos-db/gremlin-headers#status-codes\n",
    "    #\n",
    "    # See also list of available response status attributes that Gremlin API can return:\n",
    "    #     https://docs.microsoft.com/en-us/azure/cosmos-db/gremlin-headers#headers\n",
    "    cosmos_status_code = e.status_attributes[\"x-ms-status-code\"]\n",
    "    if cosmos_status_code == 409:\n",
    "        print('Conflict error!')\n",
    "    elif cosmos_status_code == 412:\n",
    "        print('Precondition error!')\n",
    "    elif cosmos_status_code == 429:\n",
    "        print('Throttling error!');\n",
    "    elif cosmos_status_code == 1009:\n",
    "        print('Request timeout error!')\n",
    "    else:\n",
    "        print(\"Default error handling\")\n",
    "\n",
    "    traceback.print_exc(file=sys.stdout) \n",
    "    sys.exit(1)\n",
    "\n",
    "print(\"\\nAnd that's all! Sample complete\")\n",
    "input(\"Press Enter to continue...\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7f65d7a8",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
